if(device) var _device = device;
var device = {};
(function(d){
	d.version = '0.0.2';
	var ua = navigator.userAgent.toLowerCase();
	var app = navigator.appVersion.toLowerCase();
	// /////////////////////////////////////////////////////////////////////////
	// スマホ
	// /////////////////////////////////////////////////////////////////////////
	// =========================================================================
	// iPhone & iPad の設定
	// =========================================================================
	if(ua.indexOf('iphone') > 0 || ua.indexOf('ipad') > 0){
		d.name = ua.indexOf('iphone') > 0 ? 'iPhone': 'iPad';
		d.os = 'iOS';
		console.log(ua);
		ua.replace(/os ([0-9,_]*)/,function(data,hit){
			d.os_version = {};
			d.os_version.all = hit;
			d.os_version.place = hit.split('_');
		});
	}
	// =========================================================================
	// Android の設定
	// =========================================================================
	else if(ua.indexOf('android') > 0){
		d.os = 'Android';
		ua.replace(/android ([0-9,¥.]*)/,function(data,hit){
			d.os_version = {};
			d.os_version.all = hit;
			d.os_version.place = hit.split('.');
		});
	}
	// /////////////////////////////////////////////////////////////////////////
	// PC の設定
	// /////////////////////////////////////////////////////////////////////////
	else{d.name = 'PC';
		// =====================================================================
		// IE の設定
		// =====================================================================
		if(app.indexOf('msie') > 0){
			d.browser = 'IE';
			if(app.indexOf('trident') > 0) d.engine = 'Trident';
		}
		// =====================================================================
		// FireFox の設定
		// =====================================================================
		else if(app.indexOf('firefox') > 0){
			d.browser = 'FireFox';
		}
		// =====================================================================
		// Chrome の設定
		// =====================================================================
		else if(app.indexOf('chrome') > 0){
			d.browser = 'Chrome';
		}
		// =====================================================================
		// Safari の設定
		// =====================================================================
		else if(app.indexOf('safari') > 0){
			d.browser = 'Chrome';
		}
	}
})(device);